; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 8152)
	(= (fuel plane1) 1940)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at plane2 city1)
	(= (capacity plane2) 2636)
	(= (fuel plane2) 841)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at plane3 city0)
	(= (capacity plane3) 5229)
	(= (fuel plane3) 418)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 5)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at plane4 city3)
	(= (capacity plane4) 12323)
	(= (fuel plane4) 3033)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 14)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at plane5 city0)
	(= (capacity plane5) 7679)
	(= (fuel plane5) 232)
	(= (slow-burn plane5) 3)
	(= (fast-burn plane5) 9)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 7)
	(at person1 city2)
	(at person2 city0)
	(at person3 city2)
	(at person4 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 641)
	(= (distance city0 city2) 610)
	(= (distance city0 city3) 633)
	(= (distance city1 city0) 641)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 762)
	(= (distance city1 city3) 612)
	(= (distance city2 city0) 610)
	(= (distance city2 city1) 762)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 935)
	(= (distance city3 city0) 633)
	(= (distance city3 city1) 612)
	(= (distance city3 city2) 935)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city3)
	(at person1 city3)
	(at person2 city3)
	(at person3 city2)
	(at person4 city0)
	))

(:metric minimize (+ (* 5 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person2 plane3 city0)
   deleted: (at person2 city0)
   added: (in person2 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 1 of 5
2. (board person4 plane2 city1)
   deleted: (at person4 city1)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 5
3. (refuel plane3 city0)
   changed: (fuel plane3) from 418 to 5229
   goals met: 1 of 5
4. (fly plane3 city0 city3)
   deleted: (at plane3 city0)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 0 to 1266, (fuel plane3) from 5229 to 3963
   goals met: 1 of 5
5. (debark person2 plane3 city3)
   deleted: (in person2 plane3)
   added: (at person2 city3)
   changed: (onboard plane3) from 1 to 0
   goals met: 2 of 5
6. (fly plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 1266 to 1907, (fuel plane2) from 841 to 200
   goals met: 2 of 5
7. (debark person4 plane2 city0)
   deleted: (in person4 plane2)
   added: (at person4 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 5
8. (refuel plane2 city0)
   changed: (fuel plane2) from 200 to 2636
   goals met: 3 of 5
9. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 1907 to 2517, (fuel plane2) from 2636 to 2026
   goals met: 3 of 5
10. (board person1 plane2 city2)
   deleted: (at person1 city2)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 5
11. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 2517 to 3452, (fuel plane2) from 2026 to 1091
   goals met: 4 of 5
12. (debark person1 plane2 city3)
   deleted: (in person1 plane2)
   added: (at person1 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 5
